BbllYLL/stm32-learn-code/0_宠物自动喂食项目/hardware/Servo.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"

void Servo_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_OCInitTypeDef TIM_OCInitStructure;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	RCC_APB2PeriphClockCmd (RCC_APB2Periph_GPIOB,ENABLE);
	

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM3);
	
	
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 20000 - 1;            //ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72 -1;           //PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);
	
	
	
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;                           //CCR
	TIM_OC4Init(TIM3,&TIM_OCInitStructure);
	
	TIM_Cmd(TIM3,ENABLE);
}

//0     500
//180   2500
void Servo_SetAngle(float Angle)
{
	TIM_SetCompare4(TIM3,Angle / 180 * 2000 + 500);
}

uint8_t Flag;
uint16_t FEED[6] = {0, 90, 180, 90, 0};

void setFEED(void)
{
	uint8_t i;
	if(Flag == 0 )
	{
		Flag = 1;//正转
		for(i=0;i<3;i++)//喂食，旋转三次
		{
			Servo_SetAngle(FEED[i]);//FEED为数组，存放舵机的旋转角度
			delay_ms(1000);
		}
	}
	else
	{
		Flag = 0;//反转
		for(i=3;i<6;i++)
		{
			Servo_SetAngle(FEED[i]);
			delay_ms(1000);
		}
	}
}
